* 여성분들이 가장 많이 종사하고 있는 직종 파악하기

In [2]:
import pandas as pd
import seaborn as sns

In [4]:
df = pd.read_csv('occupations.csv', index_col=0)

In [5]:
df.head(5)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [6]:
women = df[df['gender'] == 'F']

In [8]:
women['occupation'].value_counts().sort_values(ascending=False)

student          60
administrator    36
other            36
librarian        29
educator         26
writer           19
artist           13
healthcare       11
marketing        10
homemaker         6
programmer        6
none              4
executive         3
salesman          3
scientist         3
engineer          2
lawyer            2
entertainment     2
retired           1
technician        1
Name: occupation, dtype: int64

* 남성분들이 가장 많이 종사하고 있는 직종 파악하기

In [10]:
men = df[df['gender'] == 'M']

In [11]:
men['occupation'].value_counts().sort_values(ascending=False)

student          136
educator          69
other             69
engineer          65
programmer        60
administrator     43
executive         29
scientist         28
technician        26
writer            26
librarian         22
entertainment     16
marketing         16
artist            15
retired           13
lawyer            10
salesman           9
doctor             7
healthcare         5
none               5
homemaker          1
Name: occupation, dtype: int64